modules/adminshop/models/Admin_user.php

    public static function findIdentity($id)
    {
        return static::findOne($id);
---
SELECT * FROM `ecs_Admin_user` WHERE `user_id`=1

    public static function findByuser_name($user_name)
    {
        return static::findOne(['user_name'=>$user_name]);
---
SELECT * FROM `ecs_Admin_user` WHERE `user_name`='admin'