modules/adminshop/models/Shop_config.php

    public function load_config()
    {
        $arr = array();


        /*$sql = 'SELECT code, value FROM ' . $GLOBALS['ecs']->table('shop_config') . ' WHERE parent_id > 0';
        $res = $GLOBALS['db']->getAll($sql);*/

        $query = $this->find();
---
SELECT * FROM `ecs_shop_config` WHERE parent_id > 0