modules/adminshop/models/Uploadform.php

    public function create($params)
    {
        $this->scenario = self::SCENARIO_CREATE;
        if (!$this->load($params) && !$this->validate()) return false;

        $this->file_dir = $this->getDir();
        $this->column_name = $this->getColumn();



        return $this->save();
---
INSERT INTO `ecs_uploadform` (`table_name`, `file_type`, `file_dir`, `column_name`, `file_name`) VALUES ('shop_config', 1, 'upload/shopconfig/', 'id', '1451052346.jpg')

    public function updateColumnValue($columnValue, $fileName)
    {


        $count = $this->find()->where(['column_value'=>$columnValue, 'file_name'=>$fileName])->count();
        $sql = $this->find()->where(['column_value'=>$columnValue, 'file_name'=>$fileName])->createCommand()->getRawSql();

        if ($count) {
            //数据没有修改，返回

            return false;
        }

        //将旧的column_value清空
        \Yii::$app->db->createCommand()->update(self::tableName(), ['column_value'=>''], ['column_value'=>$columnValue])->execute();

        //更新新的column_value
        $upRow = $this->findOne(array('file_name'=>$fileName));
        $upRow->column_value = $columnValue;
        $upRow->save();
---
SELECT COUNT(*) FROM `ecs_uploadform` WHERE (`column_value`=118) AND (`file_name`='1451052353.jpg')
UPDATE `ecs_uploadform` SET `column_value`='' WHERE `column_value`=118
SELECT * FROM `ecs_uploadform` WHERE `file_name`='1451052353.jpg'
UPDATE `ecs_uploadform` SET `column_value`=118 WHERE `upload_id`='118'