modules/adminshop/controllers/UsersController.php

    public function actionList(){


        $rankList = User_rank::find()->orderBy('min_points asc')->all();
---
SELECT * FROM `ecs_user_rank` ORDER BY `min_points`