modules/adminshop/views/Users/list.php

SELECT * FROM `ecs_users` LIMIT 3 OFFSET 3
SELECT COUNT(*) FROM `ecs_users`
---

        <?php

        $dataProvider = new ActiveDataProvider([
            'query' => Users::find(),
            'pagination' => [
                'pageSize' => 3
            ]
        ]);